---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ClosedProfileRoof
source: html/a0a6f09d-bdc2-cd21-cf1f-d7b7e59b7b54.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ClosedProfileRoof Property

Extrusion roof sketch must be open. The roof's thickness and material composition are defined in its type.

## Syntax (C#)
```csharp
public static FailureDefinitionId ClosedProfileRoof { get; }
```